//======================================//
// インクルード                         //
//======================================//
#include "I2C_MPU9250.h"
//====================================//
// グローバル変数の宣言							//
//====================================//
// IMUから取得したデータ
volatile int 	rawXa = 0, rawYa = 0, rawZa = 0;	// 加速度(16bitデータ)
volatile int 	rawXg = 0, rawYg = 0, rawZg = 0;	// 角加速度(16bitデータ)

volatile short 	rawTemp;			// 温度(16bitデータ)

// データ処理
double 	TurningAngleIMU;	// IMUから求めたヨー角度
double	RollAngleIMU;		// IMUから求めたロール方向角度
double 	PichAngleIMU;		// IMUから求めたピッチ方向角度
double	TempIMU;			// IMUの温度
short		offset[3];			// オフセット値(16bit)

char	whoami;
char cnt_imu = 0;

///////////////////////////////////////////////////////////////////////////
// モジュール名 wait_IMU								//
// 処理概要     遅延処理								//
// 引数         遅延時間(ms)								//
// 戻り値       なし									//
///////////////////////////////////////////////////////////////////////////
void wait_IMU ( short waitTime )
{
	volatile int time, i = 0;
	
	time = (int)waitTime * ( CLOCK * 1000 ) / 16;
	for ( i = 0; i < time; i++) __nop();
}
///////////////////////////////////////////////////////////////////////////////////////////////////
// モジュール名 IMUWriteByte											//
// 処理概要     指定したレジスタにデータを書き込む								//
// 引数         slaveaddr:スレーブアドレス reg:レジスタのアドレス data:書き込みデータ	//
// 戻り値       なし													//
///////////////////////////////////////////////////////////////////////////////////////////////////
void IMUWriteByte( char reg, char data )
{
	uint8_t sendData[2] = { reg, data }, num = 2;
    
	I2C_IMU_COMMAND;		// コマンド送信
}
///////////////////////////////////////////////////////////////////////////
// モジュール名 IMUReadByte							//
// 処理概要     指定したレジスタのデータを読む				//
// 引数         slaveaddr:スレーブアドレス reg:レジスタのアドレス	//
// 戻り値       0:正常に受信　1:受信不可						//
///////////////////////////////////////////////////////////////////////////
char IMUReadByte( char reg )
{
	uint8_t sendData[1] = { reg }, num = 1, reciveData[1];
  	
	I2C_IMU_COMMAND;		// コマンド送信
	I2C_IMU_RECIVE;		// データ送信
	
	return reciveData[0];
}
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// モジュール名 IMUReadArry																//
// 処理概要     指定したレジスタから指定の数だけデータを読む											//
// 引数         slaveaddr:スレーブアドレス addr:レジスタのアドレス num:読み取るデータ数 dataArry:データの格納先	//
// 戻り値       0:正常に通信	1:通信エラー																		//
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void IMUReadArry( char reg, char num2, char* reciveData )
{
	uint8_t sendData[1] = { reg }, num = 1;
	
	
	I2C_IMU_COMMAND;
	num = num2;
	I2C_IMU_ARRY;
}