#ifndef AD12_H_
#define AD12_H_
//====================================//
// インクルード                  	   //
//====================================//
#include "r_smc_entry.h"
//====================================//
// シンボル定義						   //
//====================================//
#define VREF    204.0
#define VAD     3.3/4096    // V/AD 1AD値あたりの電圧
#define R1      9.1         // 分圧抵抗1
#define R2      1.8         // 分圧抵抗2
//====================================//
// グローバル変数の宣言				    //
//====================================//
extern uint16_t A0_Sen[8];
extern uint16_t A1_Sen[14];
//====================================//
// プロトタイプ宣言					   //
//====================================//
void inttrruptAD0(void);
void inttrruptAD1(void);
double getVmeter(void);
#endif // AD12_H_