#ifndef ROTARYENCODER_H
#define ROTARYENCODER_H
//====================================//
// インクルード                        //
//====================================//
#include "r_smc_entry.h"
//====================================//
// シンボル定義						   //
//====================================//

//====================================//
// グローバル変数の宣言					//
//====================================//
extern uint32_t	EncoderTotal;	// 総走行距離
extern int16_t	Encoder;		// 1msごとのパルス
extern uint32_t	enc1;		    // 走行用距離カウント
extern uint32_t	enc_slope;		// 坂上距離カウント
//====================================//
// プロトタイプ宣言					   //
//====================================//
void getEncoder (void);

#endif