//====================================
// インクルード
//====================================
#include "AD12.h"
//====================================
// グローバル変数の宣言
//====================================
uint16_t A0_Sen[8];
uint16_t A1_Sen[14];
///////////////////////////////////////////////////
// モジュール名 inttrruptAD0
// 処理概要   	AD0の変換終了割り込み
// 引数         なし
// 戻り値       なし
///////////////////////////////////////////////////
void inttrruptAD0(void) {
    R_Config_S12AD0_Get_ValueResult(ADCHANNEL2,&A0_Sen[2]);
}
///////////////////////////////////////////////////
// モジュール名 inttrruptAD1
// 処理概要   	AD1の変換終了割り込み
// 引数         なし
// 戻り値       なし
///////////////////////////////////////////////////
void inttrruptAD1(void) {
    R_Config_S12AD1_Get_ValueResult(ADCHANNEL11,&A1_Sen[11]);
}
///////////////////////////////////////////////////
// モジュール名 getVmeter
// 処理概要   	バッテリ電圧の算出
// 引数         なし
// 戻り値       vmeter (double)
///////////////////////////////////////////////////
double getVmeter(void) {
    double vout, vbat;

    vout = A1_Sen[11]*VAD;      // ポート入力電圧の算出
    vbat = vout * (R1+R2)/R2;   // 電源電圧の算出

    return vbat;
}