//====================================
// インクルード
//====================================
#include "LED.h"
//====================================
// グローバル変数の宣言
//====================================

//////////////////////////////////////////////////////////////////////////
// モジュール名 led_out
// 処理概要     フルカラーLEDの色を調整
// 引数         0: 消灯 1:点灯 0x4: 赤色LED 0x2:緑色LED 0x1:青色LED
// 戻り値       なし
//////////////////////////////////////////////////////////////////////////
void led_out (uint8_t RGB){
    if ( (RGB & 0x4) == 0x4 ) PORTB.PODR.BIT.B4 = 0;
	else PORTB.PODR.BIT.B4 = 1;
	
	if ( (RGB & 0x2) == 0x2 ) PORTB.PODR.BIT.B2 = 0;
	else PORTB.PODR.BIT.B2 = 1;
	
	if ( (RGB & 0x1) == 1 ) PORTB.PODR.BIT.B0 = 0;
	else PORTB.PODR.BIT.B0 = 1;
}