//====================================
// インクルード
//====================================
#include "Rotaryencoder.h"
//====================================
// グローバル変数の宣言
//====================================
unsigned int	EncoderTotal;	// 総走行距離
signed short	Encoder;		// 1msごとのパルス
unsigned int	enc1;		// 走行用距離カウント
unsigned int	enc_slope;		// 坂上距離カウント

//////////////////////////////////////////////////////////////////////////
// モジュール名 lcd_put
// 処理概要     データ送信
// 引数         data
// 戻り値       なし
//////////////////////////////////////////////////////////////////////////
