//====================================
// インクルード
//====================================
#include "Rotaryencoder.h"
//====================================
// グローバル変数の宣言
//====================================
uint32_t	EncoderTotal;	// 総走行距離
int16_t 	Encoder;		// 1msごとのパルス
uint32_t	enc1;		    // 走行用距離カウント
uint32_t	enc_slope;		// 坂上距離カウント

//////////////////////////////////////////////////////////////////////////
// モジュール名 lcd_put
// 処理概要     データ送信
// 引数         data
// 戻り値       なし
//////////////////////////////////////////////////////////////////////////
